       IDENTIFICATION DIVISION.
           PROGRAM-ID. MOVE-COMPOSITE.
       DATA DIVISION.
       01 PERSONS.
           02 HUMAN1.
               03 NAME PICTURE IS X(20).
               03 AGE PICTURE IS S999.
           02 HUMAN2 LIKE HUMAN1.
           02 ALIEN1.
               03 NAME PICTURE IS X(20).
               03 AGE PICTURE IS Z99.
           02 ALIEN2.
               03 NAMEE PICTURE IS X(20).
               03 AGE PICTURE IS 999.
       PROCEDURE DIVISION.
           MOVE HIGH-VALUES TO NAME OF HUMAN1.
           MOVE HIGH-VALUES TO AGE OF HUMAN1.
           MOVE LOW-VALUES TO NAME OF HUMAN2 AGE OF HUMAN2.
           MOVE SPACES TO NAME OF ALIEN1 AGE OF ALIEN1.