|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
       DATA DIVISION.
       10 V1 PICTURE IS Z9.
       11 V2 PICTURE IS Z9.
