|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
       DATA DIVISION.
         10 A.
           13 B.
             15 C PICTURE IS XX.
           13 D PICTURE IS XX.
       05 E PICTURE IS XX.