|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A PICTURE IS 99.
       01 B PICTURE IS 99.
       01 C PICTURE IS 99.
       01 D PICTURE IS 99.

       PROCEDURE DIVISION.
           DIVIDE 5 INTO B GIVING C REMAINDER D.