|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
           PROGRAM-ID. COPY HELLO.
       PROCEDURE DIVISION.
           COPY SIMPLECOPY-BOOK-HELLO.