       IDENTIFICATION DIVISION.
           PROGRAM-ID. TEST.
       DATA DIVISION.
       01 WORKING-DIRECTORY.
           03 X PICTURE IS 9(5).
       PROCEDURE DIVISION.
            EVALUATE X > 10
                WHEN TRUE DISPLAY "IN POSITIVE"
                WHEN FALSE DISPLAY "IN NEGATIVE"
            END.