       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORMTIMES.
       DATA DIVISION.
       01 MYNUM PICTURE IS 99.
       PROCEDURE DIVISION.
           ACCEPT MYNUM.
           PERFORM P 4 TIMES.
      * I CALLED STOP BEFORE DEFINING IT, BUT THAT SHOULD BE POSSIBLE
           DISPLAY "IT SHOULD BE 8 IF INPUT IS 0: " MYNUM.
       P.
           ADD 2 TO MYNUM.
           DISPLAY DONE.
       TEST.
           PERFORM CONTINUE.
           DISPLAY HELLO.

      * BELOW IS A NEW PARAGRAPH
       CONTINUE.
           STOP.
           DISPLAY MYNUM.