       IDENTIFICATION DIVISION.
           PROGRAM-ID. ADD_COMPFIELD.
       DATA DIVISION.
       01 APPLES PICTURE IS 999.
       01 BANANAS PICTURE IS 999.
       01 PINEAPPLES PICTURE IS 999.
       01 PEARS PICTURE IS ZZZ.
       01 FRUITBOX PICTURE IS 9999.
       01 FRU PICTURE IS ZZZZ.
       01 TOTAL PICTURE IS 999999.

       PROCEDURE DIVISION.
           ACCEPT APPLES BANANAS PINEAPPLES.
           ACCEPT PEARS.
           ADD 10 TO APPLES.
           DISPLAY "APPLES AFTER ADDITION OF 10: " APPLES.
           ADD APPLES TO BANANAS GIVING FRUITBOX.
           DISPLAY "APPLES: "APPLES "BANANAS:" BANANAS "BOX: " FRUITBOX
           ADD PEARS TO PINEAPPLES GIVING FRU.
           DISPLAY "PEARS: "PEARS "PINEAPPLES: " PINEAPPLES "CHEST: " FRU
           ADD FRUITBOX FRU TO TOTAL.
           DISPLAY FRUITBOX FRU TOTAL.

