       IDENTIFICATION DIVISION.
           PROGRAM-ID. TEST.
       DATA DIVISION.
       01 WORKING-DIRECTORY.
           03 BIRTH-YEAR PICTURE IS 9(4).
           03 CURRENT-YEAR PICTURE IS 9(4).
       PROCEDURE DIVISION.
           ACCEPT BIRTH-YEAR
           ACCEPT CURRENT-YEAR.
           EVALUATE CURRENT-YEAR - BIRTH-YEAR
               WHEN 1 THROUGH 17 DISPLAY "NOT LEGAL AGE"
               WHEN 18 THROUGH 99 DISPLAY "LEGAL AGE"
               WHEN OTHER DISPLAY "WRONG AGE"
               END.


