       IDENTIFICATION DIVISION.
           PROGRAM-ID. FIB.
           AUTHOR. ANONYMOUS.
           DATE-WRITTEN. 2019-11-01.
       DATA DIVISION.
       01 WORKING-STORAGE-AREA.
            05 end PICTURE IS 99.
            05 cur PICTURE IS 9(20).
            05 LAST.
             09 N LIKE CUR.
             09 N-1 LIKE CUR.
       PROCEDURE DIVISION.
            DISPLAY "ENTER THE LIMIT".