       IDENTIFICATION DIVISION.
           PROGRAM-ID. COPYLOOP.
           AUTHOR. BARISTAS.
       PROCEDURE DIVISION.
           COPY "SRC/EXAMPLES/COPYLOOP/COPYLOOPAB.COFFEE".