       IDENTIFICATION DIVISION.
           PROGRAM-ID. VARIABLEREPRESENTATION.
       DATA DIVISION.
       01 PER-DAY PICTURE IS 9999V99 OCCURS 7.
       01 WEEK-TOTAL LIKE PER-DAY.
       PROCEDURE DIVISION.
           ACCEPT PER-DAY(1).
           ACCEPT WEEK-TOTAL.
