       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A PICTURE IS 99.
       01 B PICTURE IS 99.

       PROCEDURE DIVISION.
           ADD 5 TO A GIVING B.