       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A.
         03 C PICTURE IS 99.
       01 B PICTURE IS 99.
       01 C PICTURE IS 99.
       01 D PICTURE IS 99.

       PROCEDURE DIVISION.
           DIVIDE D INTO B GIVING C REMAINDER A.