       IDENTIFICATION DIVISION.
           PROGRAM-ID. EVALUATION TEST.

       DATA DIVISION.
       77 X PICTURE IS XX.
       77 Y PICTURE IS XX.
       77 Z PICTURE IS 99.

       PROCEDURE DIVISION.
           EVALUATE X + Y
           WHEN Z
               DISPLAY "SIX"
           WHEN OTHER
               DISPLAY X
               DISPLAY "X1"
           END.

