       IDENTIFICATION DIVISION.
           PROGRAM-ID. SIMPLE ADD CORRESPONDING.

       DATA DIVISION.
       01 A.
         03 B.
            05 C PICTURE IS 99.
         03 C PICTURE IS AA.
       01 X.
         03 B.
            05 C PICTURE  IS 99.

       PROCEDURE DIVISION.
           MOVE 12 TO C OF B OF A.
           MOVE 14 TO C OF X.
           ADD A TO X.

      * SHOULD HAVE 26 IN C OF B OF X.
           DISPLAY C OF B OF X.
      * SHOULD STILL HAVE 12 IN C OF B OF A.
           DISPLAY C OF B OF A.