       IDENTIFICATION DIVISION.
       DATA DIVISION.

       01 val PICTURE IS Z99.
       01 JUMP-TARGET PICTURE IS XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.

       PROCEDURE DIVISION.
           MOVE 26 TO val
           DISPLAY val DELIMITED BY SPACE WITH NO ADVANCING
           MOVE SPACES TO JUMP-TARGET
           MOVE " DYNAMIC - FUNCTION" TO JUMP-TARGET
      * EVEN THE DYNAMIC JUMPS ARE CONVERTED TO LOWER-CASE AND THE SPACES ARE REMOVED!
           GOTO JUMP-TARGET
           STOP.

       DYNAMIC-FUNCTION.
           DISPLAY "DYNAMIC".
           STOP.
