|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
           PROGRAM-ID. SIGNAL.

       DATA DIVISION.
       77 DYNAMICTARGET PICTURE IS XX.

       PROCEDURE DIVISION.
      * REGISTER THE ERROR HANDLER
           SIGNAL HANDLER ON ERROR.

      * PERFORM GO TO TO INVALID TARGET PARAGRAPH.
           GO TO DYNAMICTARGET.
           DISPLAY "X".
           STOP.

       HANDLER.
           DISPLAY "ERROR HANDLER CALLED".

      * HANDLER PERFORMS LIKE A GO TO, FALL-THROUGH TO THE NEXT FUNCTION IS ALLOWED
       FALL-THROUGH.
           DISPLAY "FELL THROUGH HANDLER".
