       IDENTIFICATION DIVISION.
       DATA DIVISION.

      * SEE ALSO: DEFINEDIDENTIFIERCHAINRULETEST, FOR COMPLEX COMBINATIONS WITH 'OF' AS FIELD
       01 pic PICTURE IS 99.
       01 add PICTURE IS 99.
       01 of.
         03 of PICTURE IS 99.

       PROCEDURE DIVISION.
           MOVE 12 TO pic.
           DISPLAY pic.

           MOVE 24 TO of OF of.
           DISPLAY of OF of.

           ADD pic of OF of TO add
           ADD add TO pic

           DISPLAY add.
           DISPLAY pic.
