       IDENTIFICATION DIVISION.
           PROGRAM-ID. EVALUATIONTEST.

       DATA DIVISION.
       77 X PICTURE IS XX.
       77 Y PICTURE IS XX.
       77 Z PICTURE IS XX.

       PROCEDURE DIVISION.
           EVALUATE X ALSO Y
           WHEN Y ALSO X
               ALSO DISPLAY "SIX"
           WHEN OTHER
               DISPLAY X
               DISPLAY "X1"
           END.

