       IDENTIFICATION DIVISION.
           PROGRAM-ID. SIMPLEADDCORRESPONDING.

       DATA DIVISION.
       01 A.
         03 B.
            05 C PICTURE IS 99.
            05 E PICTURE IS 99.
         03 C PICTURE IS XX.

       01 X.
         03 B.
            05 C PICTURE  IS 99.
         03 A.
            05 E PICTURE IS 99.
       01 B.
         03 C PICTURE IS 99.

       PROCEDURE DIVISION.
           MOVE 12 TO E OF A.
