       IDENTIFICATION DIVISION.

       DATA DIVISION.
       01 REC.
        02 LAYER1.
          03 A PICTURE IS 99.
          03 B PICTURE IS 99.
          03 X PICTURE IS 99.
        02 Z PICTURE IS 99.

       01 REC2.
        02 LAYER1.
          03 Y PICTURE IS 99.
          03 A PICTURE IS 99.
          03 B PICTURE IS 99.
        02 Z PICTURE IS 99.


       PROCEDURE DIVISION.
            MOVE 11 TO A OF LAYER1 OF REC.
            MOVE 12 TO B OF REC.
            MOVE 13 TO X OF REC.
            MOVE 44 TO Z OF REC.

            MOVE 21 TO A OF REC2.
            MOVE 22 TO B OF REC2.
            MOVE 23 TO Y OF REC2.
            MOVE 55 TO Z OF REC2.

            MOVE REC TO REC2.
      * ALTERED VALUES:
            DISPLAY A OF REC2.
            DISPLAY B OF LAYER1 OF REC2.
            DISPLAY Z OF REC2.

      * VALUES THAT SHOULD BE UNTOUCHED
            DISPLAY Y OF REC2.


