       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 B PICTURE IS 99.
       01 C PICTURE IS 99.
       01 D PICTURE IS 99.

       PROCEDURE DIVISION.
           LOOP
           VARYING A FROM B TO C BY D
           END.