       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A PICTURE IS 99.
       01 B PICTURE IS 99.
       01 C PICTURE IS 99.

       PROCEDURE DIVISION.
           SUBTRACT "5" FROM B GIVING C.