|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A PICTURE IS 99.
       01 C PICTURE IS XX.

       PROCEDURE DIVISION.
           IF C = "DEF" THEN
               MOVE "AB" TO C.
