       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A.
         03 B.
           05 C PICTURE IS XX.
         03 D PICTURE IS XX.
       01 E LIKE C.