|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A.
         03 C PICTURE IS 99.
       01 B PICTURE IS 99.

       PROCEDURE DIVISION.
           MULTIPLY B BY A.