       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A.
         03 C PICTURE IS 99.
       01 B PICTURE IS 99.

       PROCEDURE DIVISION.
           MULTIPLY B BY A.