       IDENTIFICATION DIVISION.
       DATA DIVISION.

      * THIS WILL TURN INTO AN ARRAY WITH THE PICTURE 9999
       01 ARRAY PICTURE IS 9999 OCCURS 3 TIMES.

      * THIS WILL TURN INTO A RECORD, BECAUSE THERE IS NO SPACE RIGHT AFTER THE RECORD (IF YOU DID 'RECORD P' IT WOULD BE A PICTURE)
       01 RECORDPICTUREISAX.
      * THIS WILL TURN INTO THE VARIABLE 'FIELD' WITH PICTURE 'XX'
        05 FIELD PICTURE IS XX.

      * HAVE FUN READING THIS PROCEDURE DIVISION ;)
       PROCEDURE DIVISION.
           MOVE 1234 TO ARRAY (1)
           DISPLAY "ARR[0]=" ARRAY (1).

           MOVE "OH" TO FIELD OF RECORDPICTUREISAX.
           DISPLAY FIELD OF RECORDPICTUREISAX.
           STOP.