       IDENTIFICATION DIVISION.
           PROGRAM-ID. EVALUATIONTEST.

       DATA DIVISION.
       77 X PICTURE IS 99.
       77 Y PICTURE IS 99.
       77 Z PICTURE IS 99.

       PROCEDURE DIVISION.
           EVALUATE X + Y
           WHEN A
               DISPLAY "SIX"
           WHEN OTHER
               DISPLAY "OTHER"
               DISPLAY "X1"
           END.

