       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A.
         03 C PICTURE IS 99.
       01 D PICTURE IS 99.
       01 E.
         03 F PICTURE IS 99.
       PROCEDURE DIVISION.
           ADD A TO E.