       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A.
         03 B PICTURE IS 99.
       01 C PICTURE IS 99.
       01 D PICTURE IS 99.

       PROCEDURE DIVISION.
           LOOP
           VARYING FROM A TO C BY D
           END.