|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
      * PERFORM + GO TO INTERPLAY EXAMPLE
       IDENTIFICATION DIVISION.
           PROGRAM-ID. PERFORM-GO-TO.
       PROCEDURE DIVISION.
       A.
           DISPLAY "A" WITH NO ADVANCING.
      *    PRINT B AND COME BACK
           PERFORM B.
      *    PRINT B AND C AND COME BACK
           PERFORM B THROUGH C.
      *    PRINT D AND E AND COME BACK, D WILL GO TO E BUT THE EXECUTION WILL CONTINUE
           PERFORM D THROUGH E.
      *    PRINT C AND D AND THEN GO TO E WHICH IS OUTSIDE THE RANGE
      *    SO THE EXECUTION WILL GO TO F AND STOP
           PERFORM C THROUGH D.
      *    SO WE WILL NEVER RETURN HERE TO EXECUTE THE FOLLOWING STATEMENT
           DISPLAY "A" WITH NO ADVANCING.
       B.
           DISPLAY "B" WITH NO ADVANCING.
       C.
           DISPLAY "C" WITH NO ADVANCING.
       D.
           DISPLAY "D" WITH NO ADVANCING.
           GO TO E.
      *    THE FOLLOWING STATEMENT IS ALWAYS DEAD CODE
           DISPLAY "D" WITH NO ADVANCING.
       E.
           DISPLAY "E" WITH NO ADVANCING.
       F.
           DISPLAY "F" WITH NO ADVANCING.
           STOP.