|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A.
        03 B PICTURE IS XX OCCURS 3 TIMES.

       PROCEDURE DIVISION.
           MOVE "AB" TO B OF A(1).
           MOVE "CD" TO B OF A(2).
           MOVE "EF" TO B OF A(3).

      * EUHM

           DISPLAY B OF A(1).
           DISPLAY B OF A(2).
           DISPLAY B OF A(3).
