       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A PICTURE IS 99.
       01 C PICTURE IS XX.

       PROCEDURE DIVISION.
           IF 1 = 1 THEN
               ADD C TO A.
