       IDENTIFICATION DIVISION.
       DATA DIVISION.
       77 A PICTURE IS 9.
       77 B PICTURE IS 9.
       77 C PICTURE IS 9.
       77 D PICTURE IS 9.
       77 E PICTURE IS 9.
       77 F PICTURE IS 9.
       77 ADD PICTURE IS 9.
       77 TO PICTURE IS 9.

       PROCEDURE DIVISION.
      * THE FOLLOWING ADDS ARE TAKEN FROM: HTTPS://CANVAS.UTWENTE.NL/COURSES/12236/PAGES/LEVEL-2-FEATURES
      * THIS LL(1) PARSER CANNOT PARSE SOME THINGS BECAUSE IT NEEDS MORE LOOKAHEAD FOR THAT
           ADD A TO B ADD C TO D ADD E TO F.
           ADD A TO B ADD C TO D ADD E TO F.
           ADD A TO B ADD C TO D ADD E TO F.

      * CANNOT PARSE THE FOLLOWING LINE, BECAUSE THE FIRST 'TO' IS CAPITALIZED
      *    ADD A TO B ADD C TO D ADD E TO F.

           ADD A TO B ADD C TO D ADD E TO F.

      * CANNOT PARSE THE FOLLOWING LINE BECAUSE THE LAST 'TO' IS NOT CAPITALIZED
      *    ADD A TO B ADD C TO D ADD E TO F.