|...+.*A.1.B..+....2....+....3....+....4....+....5....+....6....+....7..
       IDENTIFICATION DIVISION.
       DATA DIVISION.
       10 V1 PICTURE IS Z9.
       10 V2 PICTURE IS Z9.
       10 V3 LIKE V2 OF V1.
