       IDENTIFICATION DIVISION.
       DATA DIVISION.

      *DEFINES 'PICTURE' WITH PICTURE BEING '999'ALSO DEFINES 'HOLYPICTUREIS99' RECORD (NOTE THE LINE CONTINUATION, I.E. WE ASSUME THERE IS NO SPACE AFTER 'HOLY', CONTINUATION LINES MUST START IN AREA B).
       01 P PICTURE IS 999 OCCURS 2 TIMES.
       01 HOLY PICTURE IS 99.
       03 FIELD PICTURE IS 99.

      * DEFINE THE FIELD 'DISPLAY'
       01 display PICTURE IS XX.

       PROCEDURE DIVISION.
      * DISPLAY ASSUMED TO BE DISPLAY STATEMENT KEYWORD
           DISPLAY "ATROCIOUS"
           MOVE "OH" TO display
           PERFORM ADDPICTURETOFIELDOFHOLYPICTURE
           DISPLAY display.
           STOP.

      * THE FOLLOWING LINE ACTUALLY DEFINES A FUNCTION NAMED 'ADDPICTURETOFIELDOFHOLYPICTURE' BECAUSE IT STARTS IN AREA A! THIS BEHAVIOUR MIGHT THROW YOU OFF AT TIMES
         ADDPICTURETOFIELDOFHOLYPICTURE.
           DISPLAY "STOP THIS PLEASE".

       FUNCTION.
           MOVE "NO" TO display.
           DISPLAY display.



