       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A PICTURE IS 99.
       01 C PICTURE IS XX.

       PROCEDURE DIVISION.
           IF (1 + 2) + (A + (A + C)) = A THEN
               DISPLAY "WHAT?".
