       IDENTIFICATION DIVISION.
       DATA DIVISION.
       01 A PICTURE IS 99.
       01 C PICTURE IS XX.
       PROCEDURE DIVISION.
           LOOP
           ADD C TO A
           END.